<?php
/*
 * Copyright (C) www.wellcms.cn
 */
!defined('DEBUG') and exit('Forbidden');

$arr = setting_get('conf');
$arr['filter'] = array(
    'url' => 1, // 过滤链接
    'ip_enable' => 0, // 过滤IP 1开启
    'ips' => array(), // IP数组
    'username' => array(
        'enable' => 0,
        'limit' => 0, // 0不限 1限制英文或数字
        // 过滤时去掉所有特殊字符
        'keyword' => array('admin', 'administrator', 'root', '管理员', '管理', '管理員', '版主', '壇主', '坛主', '博主', '管理员', '版主', '超级管理员', '超级管理员', '冠军', '第一', '第一名', '冠軍', '站长', '本站站长', '高手', '大师', '大神', '专家', '砖家', '法师', '上师', '官方', '教主', '盟主', '主席', '总理', '政治', '军委', '领导', '官员', '毛泽东', '周恩来', '邓小平', '彭德怀', '朱德', '江泽民', '朱镕基', '胡锦涛', '温家宝', '习近平', '李克强', '中共', '共产党', '党中央', '厅长', '省长', '市长', '厅长', '官员', '局长', '集团军', '军长', '特务', '特工', '间谍', '反贪', '反腐', '腐败', '我擦', '操你', '嫖娼', '妓女', '造人', '约炮', '泡妞', '屄', '操逼', '艹屄', '操屄', '艹逼', '乳房', '乳头', '阴道', '子宫', '屌', '鸡鸡', '鸡巴', '阴茎', '龟头', '乳房', '招妓', '找小姐', '精液', '精子', '卵子', '淫荡', '少妇', '骚货', '风骚', '浪货', '贱货', '荡妇', '骚逼', '娘们', '色情', '三级', '录像', '日本', '韩国', '欧美', '东南亚', '性服务', '三陪', '3陪', '双飞', '群陪', '性交', '群交', '做爱', '幼交', '口交', '刚交', '肛交', '乳交', '口爆', '阴毛', '吊毛', '屌毛', '口暴', '充气娃娃', '安全套', '避孕', '爱爱', '双休', '法轮功', '邪教', '李洪志', '国家', '国安局', '日剧', '韩剧', '美剧', 'sex', 'sexy', '出轨', '吸毒', '贩毒', '医师', '医院', '医疗', '医生', '诱惑', '色诱', '吞精', '刻章', '代孕', '待孕', '贷款', '带款', '带款', '信用卡', '取现', '套现', '抵押', '公积金', '五险一金', '医保', '房贷', '放贷', '刷卡', '赚钱', '理财', '投资', '生钱', '直销', '传销', '返利', '分销', '拉人头', '联盟', '公益', '慈善', '红十字', '利息', '利润')
    ),
    'content' => array(
        'enable' => 0,
        // 过滤所有特殊再过滤关键词，如果为空说明随便写的内容
        'keyword' => array('军委', '领导', '官员', '毛泽东', '周恩来', '邓小平', '彭德怀', '朱德', '江泽民', '朱镕基', '胡锦涛', '温家宝', '习近平', '李克强', '中共', '共产党', '党中央', '厅长', '省长', '市长', '厅长', '官员', '局长', '集团军', '军长', '特务', '特工', '间谍', '反贪', '反腐', '腐败', '我擦', '操你', '嫖娼', '妓女', '做鸡', '约炮', '鸡婆', '泡妞', '屄', '操逼', '艹屄', '操屄', '艹逼', '乳房', '乳头', '阴道', '子宫', '屌', '鸡鸡', '鸡巴', '阴茎', '龟头', '乳房', '招妓', '小姐', '精液', '精子', '卵子', '淫荡', '少妇', '骚货', '风骚', '浪货', '贱货', '荡妇', '骚逼', '娘们', '色情', '三级', '录像', '日本', '韩国', '欧美', '东南亚', '性服务', '三陪', '3p', '3陪', '双飞', '群陪', '性交', '群交', '换妻', '做爱', '幼交', '口交', '后庭', '肛交', '乳胶', '口爆', '潮喷', '露阴', '阴毛', '内射', '颜射', '白浆', '炮友', '吊毛', '屌毛', '口暴', '充气娃娃', '安全套', '避孕', '爱爱', '双休', '法轮功', '邪教', '李洪志', '国家', '国安局', '日剧', '韩剧', '美剧', 'shab', 'shabi', '沙比', '煞笔', '傻逼', 'sb', 'sex', 'sexy', '出轨', '吸毒', '贩毒', '医师', '诱惑', '色诱', '吞精', '刻章', '代孕', '待孕', '贷款', '带款', '带款', '信用卡', '取现', '套现', '抵押', '返利', '微商', 'qq', 'weixin', '微信', 'v信', '红十字', '政变', '优果', '优果', '亡灵', '吸毒', '白粉', '冰毒', '大麻', '海洛因', '冰毒', 'a片', '黄片'),
    ),
);
setting_set('conf', $arr);

?>